Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Some of the books we've listed appear almost ancient in internet scale, but we've included those books because they still describe the current way of doing things.
es: En la escala temporal de Internet, algunos de los libros de la lista parecen anticuados, pero los hemos incluido porque su contenido sigue siendo válido en la actualidad.

source: Some of the highlights include:
es: Algunos elementos destacados son:

source: Some of the ones we've already seen include C<print>, C<sort> and C<reverse>.
es: Ya hemos visto algunas funciones, como C<print>, C<sort> y C<reverse>.

source: Some of these books are available as free downloads.
es: Algunos de estos libros están disponibles como descargas gratuitas:

source: Some people get too used to writing things like:
es: Algunas personas se acostumbran a escribir cosas como:

source: Some people may wish to outlaw barewords entirely.
es: Es posible que algunos programadores prefieran prohibir el uso de palabras sueltas.

source: Some programmers choose to use an explicit conversion so as to leave nothing to doubt:
es: Algunos programadores eligen usar una conversión explícita para que no haya ninguna duda:

source: Some use the UTF8 flag for this, but that's misuse, and makes well behaved modules like Data::Dumper look bad.
es: Hay quien usa la marca UTF8 para esto, pero es un uso incorrecto que hace que parezca que hay errores en módulos que funcionan correctamente, como Data::Dumper.

source: Some words in English work this way, like "fish" and "sheep".
es: Existen algunas palabras en español que funcionan de esa manera, como "crisis", "ciempiés" o "lunes", que se usan como singular o plural en función del contexto.

source: Some would say I<too> many.
es: Hay quien piense que de I<demasiadas>.

source: Some_package::foo();
es: Un_paquete::foo();

source: Someone like Larry, or one of his peculiar friends.
es: El de Larry o alguno de sus peculiares amigos.

source: Someone who "carries" software from one L</platform> to another.
es: Miembro del equipo de desarrollo principal. Alguien que adapta software de una L</plataforma> a otra.

source: Someone who breaks security on computer systems.
es: Alguien capaz de burlar la seguridad de los sistemas informáticos.

source: Someone who is brilliantly persistent in solving technical problems, whether these involve golfing, fighting orcs, or programming.
es: Persona que se caracteriza por una persistencia brillante para resolver problemas técnicos, ya sean de golf, de lucha contra los orcos o de programación.

source: Something "iffy".
es: Algo "incierto".

source: Something extra that happens when you evaluate an L</expression>.
es: Algo adicional que sucede cuando se evalúa una L</expresión>.

source: Something like a UUCP or PPP chat script or an expect script fits the bill nicely, as do configuration scripts run by a program at its start up, such F<.cshrc> or F<.ircrc>, for example.
es: Algo como un script de chat UUCP o PPP, o un script de automatización con la utilidad expect, se ajusta muy bien a esta definición, igual que los scripts de configuración ejecutados en el inicio de un programa, como F<.cshrc> o F<.ircrc>, por ejemplo.

source: Something not owned by anybody.
es: Se dice de algo que no es propiedad de nadie.

source: Something that "knows" what user-defined type (class) it is, and what it can do because of what class it is.
es: Algo que "sabe" a qué tipo definido por el usuario (clase) pertenece, y lo que puede hacer por ser de esa clase.

source: Something we'd call a L</metacharacter> except that it's a sequence of more than one character.
es: Algo que podríamos llamar L</metacarácter> si no fuera porque está formado por una secuencia de varios caracteres.

source: Something you can see from anywhere, usually used of L<variables|/variable> and L<subroutines|/subroutine> that are visible everywhere in your program.
es: Algo que se puede ver en cualquier lugar, generalmente L<variables|/variable> y L<subrutinas|/subrutina> que están visibles en cualquier punto del programa.

source: Something you do for someone else to make them happy, like giving them the time of day (or of their life).
es: Algo que se hace por alguien para darle felicidad, como alegrarle el día (o incluso justificar toda una vida).

source: Sometimes confused with L</PATH>.
es: A veces se confunde con L</PATH>.

source: Sometimes pronounced L</trinary>.
es: A veces también se llama L</trino>.

source: Sometimes called a "plain" file.
es: A veces se llama archivo "simple".

source: Sometimes instead of zeroing the allocated heap by using Newxz() you should consider "poisoning" the data.
es: A veces, en lugar de inicializar en cero el montículo (I<heap>) asignado mediante Newxz(), podría preferir la opción de "envenenar" los datos.

source: Sometimes known as a "partition".
es: A veces se denomina "partición".

source: Sometimes minimal matching can help a lot.
es: A veces una coincidencia mínima puede ser de gran ayuda.

source: Sometimes pronounced L</ternary>.
es: Es equivalente a L</ternario>.

source: Sometimes used metaphorically as the terminating string of a L</here document>.
es: A veces se usa metafóricamente como la cadena de terminación de un L</documento incrustado>.

source: Sometimes we also say "block" to mean a lexical scope; that is, a sequence of statements that act like a L</BLOCK>, such as within an L<eval|perlfunc/eval> or a file, even though the statements aren't delimited by braces.
es: A veces también usamos la palabra "bloque" para hacer referencia a un ámbito léxico; es decir, una secuencia de instrucciones que actúan como un L</BLOQUE>, por ejemplo, dentro de una función L<eval|perlfunc/eval> o en un archivo, aunque las instrucciones no estén delimitadas por llaves.

source: Sometimes we say that classes B<consume> roles.
es: Se puede decir que las clases B<consumen> roles.

source: Sometimes we say that the child has an B<is-a> relationship with its parent class.
es: Algunas veces se dice que la clase derivada tiene una relación de tipo "es un" (B<is-a> en inglés) con su clase primaria.

source: Sometimes we talk about a L</Boolean context> inside conditionals, but this imposes no additional constraints, since any scalar value, whether numeric or L</string>, is already true or false.
es: A veces hablamos de un L</contexto booleano> en condicionales, pero esto no impone ninguna restricción adicional, puesto que cualquier valor escalar, tanto numérico como de tipo L</cadena>, ya es verdadero o falso.

source: Sometimes we use the term loosely to mean a L</composer>.
es: A veces usamos este término de forma informal para referirnos a un L</sistema de composición>.

source: Sometimes, an author might simply be rebasing the branch onto a newer source point.
es: En algunos casos, el autor simplemente reorganiza la rama para asignarle un nuevo punto de origen.

source: Sometimes, an author might have found an error in an early commit which they wanted to fix before merging the branch to blead.
es: También puede ocurrir que un autor haya detectado un error en una confirmación anterior que desea corregir antes de combinar la rama con blead.

source: Sometimes, blead will move while you're building or testing your changes.
es: A veces blead se mueve mientras usted compila o prueba sus cambios.

source: Space after each comma.
es: Espacio después de cada coma.

source: Space after last parenthesis matching on current line.
es: Espacio después del último emparejamiento de paréntesis en la línea actual.

source: Space around a "complex" subscript (inside brackets).
es: Espacio en torno a un subíndice "complejo" (entre corchetes).

source: Space around most operators.
es: Espacio en torno a la mayoría de operadores.

source: Space before the opening curly of a multi-line BLOCK.
es: Espacio antes de llave de apertura de un BLOQUE multilínea.

source: Speakers of this language think it's easy to learn because it's so easily twisted to one's own ends, but dialectical differences make tribal intercommunication nearly impossible, and travelers are often reduced to a pidgin-like subset of the language.
es: Los hablantes de esta lengua piensan que es fácil de aprender, ya que se adapta fácilmente a sus necesidades, pero las diferencias entre dialectos hacen que la comunicación entre las distintas tribus sea prácticamente imposible; los viajeros deben resignarse a usar un subconjunto tipo pidgin de la lengua.

source: Special variables that have side effects when you access them or assign to them.
es: Variables especiales que tienen efectos secundarios cuando se accede a ellas o se les asigna un valor.

source: Specifically, to call an L<AUTOLOAD|perlsub/Autoloading> subroutine on behalf of an undefined subroutine.
es: Específicamente, se realiza la carga automática cuando se llama a una subrutina L<AUTOLOAD|perlsub/Autoloading> en nombre de una subrutina indefinida.

source: Specify replacement for groff
es: Especifique el sustituto de groff

source: Specifying a negative flag after the caret is an error, as the flag is redundant.
es: Especificar una marca negativa después del signo de intercalación es un error, ya que la marca es redundante.

source: Specifying it twice gives added protection.
es: Si se especifica dos veces, proporciona protección adicional.

source: Splitting up a program text into L<tokens|/token>.
es: Dividir el texto de un programa en L<tokens|/token>.

source: Stands for "Data Base Management" routines, a set of routines that emulate an L</associative array> using disk files.
es: Significa "Data Base Management" (administración de base de datos), y es un conjunto de rutinas que emulan un L</array asociativo> mediante archivos de disco.

source: Starting in Perl 5.14 (and partially in Perl 5.12), just put a C<use feature 'unicode_strings'> near the beginning of your program.
es: Desde Perl 5.14 (y, de forma parcial, desde Perl 5.12), solo tiene que agregar C<use feature 'unicode_strings'> al principio del programa.

source: Starting in Perl 5.14, a C<"^"> (caret or circumflex accent) immediately after the C<"?"> is a shorthand equivalent to C<d-imsx>.
es: A partir de Perl 5.14, un signo C<"^"> (signo de intercalación o acento circunflejo) inmediatamente después de un signo C<"?"> equivale a C<d-imsx>.

source: Stay tuned, but don't worry that you'll have to change major versions of Perl; no one is going to take Perl 5 away from you.
es: Puede seguir su desarrollo, pero no debe preocuparse por tener que actualizar Perl; nadie va a quitarle Perl 5.

source: Still, it's useful, and works well with C<Class::Accessor> and C<Object::Tiny>
es: Aun así es útil y funciona bien con C<Class::Accessor> y C<Object::Tiny>

source: Still, we think it's a lot easier to use than writing your own OO code from scratch.
es: Sin embargo, es mucho más sencillo usar este módulo que escribir código orientado a objetos desde cero.

source: Strange though this may seem, this is the basis for the whole module import/export system.
es: Por extraño que pueda parecer, esta es la base de todo el sistema de importación/exportación de módulos.

source: Strictly speaking, Perl doesn't do this, but it relies on a reference-counting mechanism to keep things tidy.
es: En un sentido estricto, Perl no hace esto, sino que se basa en un mecanismo de recuento de referencias para mantener el orden.

source: Strictly speaking, a program that munches up another program and spits out yet another file containing the program in a "more executable" form, typically containing native machine instructions.
es: En un sentido estricto, es un programa que procesa otro programa y devuelve un archivo que contiene el programa en un formato "más fácil de ejecutar", normalmente con instrucciones nativas de código máquina.

source: Strictly speaking, a program that reads a second program and does what the second program says directly without turning the program into a different form first, which is what L<compilers|/compiler> do.
es: En un sentido estricto, es un programa que lee otro programa y hace lo que este segundo programa dice sin convertirlo en un programa distinto, que es lo que haría un L</compilador>.

source: Strictly, the shell's C<*> character, which will match a "glob" of characters when you're trying to generate a list of filenames.
es: Estrictamente, el carácter C<*> de la shell, que detectará un "glob" de caracteres cuando se intenta generar una lista de nombres de archivos.

source: String literals are usually delimited by either single or double quotes.
es: Los literales de cadena se suelen delimitar con comillas simples o dobles.

source: Strings have their own operations, such as L</concatenation>.
es: Las cadenas tienen sus propias operaciones, como la L</concatenación>.

source: Strings that match parenthesized parts of a regular expression are saved under names containing only digits after the C<$> (see L<perlop> and L<perlre>).
es: Las cadenas que coinciden con las partes encerradas entre paréntesis de una expresión regular se guardan con nombres que contienen solo dígitos después del símbolo C<$> (véase L<perlre> y L<perlop>).

source: Styles and techniques will therefore differ, although some effort has been made to not vary styles too widely in the same sections.
es: Por esta razón, habrá diversos estilos y técnicas, pero se ha procurado que en una misma sección los estilos no varíen demasiado.

source: Subclasses can use the accessors rather than having to know how a parent class is implemented internally.
es: Las subclases pueden usar los métodos de acceso, en lugar de tener que conocer la implementación interna de una clase primaria.

source: Subpatterns are numbered based on the left to right order of their opening parenthesis.
es: Los subpatrones se numeran por orden de paréntesis de apertura, de izquierda a derecha.

source: Subroutine call to a named capture group.
es: Llamada de subrutina a un grupo de captura con nombre.

source: Subroutine declarations also act as definitions if a body is supplied.
es: Las declaraciones de subrutina también actúan como definiciones si se proporciona el cuerpo de la subrutina.

source: Subroutine definitions (and declarations, for that matter) need not necessarily be situated in the package whose symbol table they occupy.
es: Las definiciones de subrutinas (y las definiciones de declaraciones) no tienen por qué ubicarse en el paquete al que pertenece la tabla de símbolos en que aparecen.

source: Subroutines can also return values:
es: Las subrutinas también pueden devolver valores:

source: Substitute C<mmk> for C<mms> above if you're using MMK.
es: Si usa MMK, cambie C<mmk> por C<mms>.

source: Such a package may also derive some of its methods from another class (package) by listing the other package name(s) in its global @ISA array (which must be a package global, not a lexical).
es: Un paquete así también pueden derivar alguno de sus métodos de otra clase (paquete) especificando el nombre de este paquete en su array global @ISA, que debe ser una variable global (no léxica) del paquete.

source: Such a referent must be indirectly accessible through at least one L</hard reference>.
es: Un referente de este tipo debe ser accesible indirectamente a través de al menos una L</referencia estricta>.

source: Such combinations can include alternatives, leading to a problem of choice: if we match a regular expression C<a|ab> against C<"abc">, will it match substring C<"a"> or C<"ab">?
es: Estas combinaciones pueden incluir alternativas, dando lugar a un problema de elección: si comparamos una expresión regular C<a|ab> con la cadena C<"abc">, ¿coincidirá con la subcadena C<"a"> o con C<"ab">?

source: Such double encoding can be compared to double HTML encoding (C<&amp;gt;>), or double URI encoding (C<%253E>).
es: Esta codificación doble es similar a la codificación doble de HTML (C<&amp;gt;>) o de URI (C<%253E>).

source: Such literals are accepted by both C<require> and C<use> for doing a version check.
es: C<require> y C<use> aceptan estos literales para realizar una comprobación de versión.

source: Summing up, Perl numeric values can store only those numbers which have a finite decimal expansion or a "short" binary expansion.
es: En resumen, en Perl los valores numéricos solo pueden almacenar números que tengan una expansión decimal finita o una expansión binaria "corta".

source: Support for specific formats are available from CPAN as C<CPANPLUS::Dist::*> modules.
es: Existe en CPAN soporte para formatos específicos (en la familia de módulos C<CPANPLUS::Dist::*>).

source: Suppose that we want to enable a new RE escape-sequence C<\Y|> which matches at a boundary between whitespace characters and non-whitespace characters.
es: Suponga que desea habilitar una nueva secuencia de escape de expresiones regulares, C<\Y|>, que coincide en el límite entre los espacios en blanco y los caracteres que no son espacios en blanco.

source: Suppose we parse text with comments being delimited by C<#> followed by some optional (horizontal) whitespace.
es: Supongamos que tenemos que analizar un texto con comentarios delimitados por signos C<#> seguidos, opcionalmente, de espacio en blanco (horizontal) adicional.

source: Suppose you're reading in data from a local format into a hash-of-hashes in Perl, turning that into a tree, walking the tree and then piping each node to an Acme Transmogrifier Server.
es: Supongamos que ha escrito un programa que lee datos en un formato local y los almacena en un hash de hashes de Perl. Después los convierte en un árbol, recorre el árbol y canaliza cada nodo hacia un servidor Acme Transmogrifier.

source: Sure enough, C<pp_pack> is in F<pp.c>.
es: Como sospechábamos, C<pp_pack> está en F<pp.c>.

source: Symbol table entries can be named with an initial '*', but you don't really care about that yet (if ever :-).
es: Las entradas de la tabla de símbolos pueden designarse con un carácter "*" inicial, aunque no hace falta que se preocupe por esto de momento (y quizá no tenga que hacerlo nunca:-)).

source: Symbolic references are illegal under L<use strict 'refs'|strict/strict refs>.
es: Con L<use strict 'refs'|strict/strict refs> no se admiten referencias simbólicas.

source: Symbols representing the concepts "and", "or", "xor", and "not".
es: Símbolo que representa conceptos como "and", "or", "xor" o "not".

source: Take care when using patterns that include C<\G> in an alternation.
es: Tenga cuidado al utilizar patrones que incluyan C<\G> en una serie de alternativas.

source: Taken together, these features go a long way towards making Perl's regular expressions more readable.
es: En conjunto, estas características mejoran en gran medida la legibilidad de las expresiones regulares de Perl.

source: Taking a pattern, usually a L</regular expression>, and trying the pattern various ways on a string to see whether there's any way to make it fit.
es: Comparación realizada de diversas maneras de un patrón (generalmente una L</expresión regular>) con una cadena para intentar detectarlo.

source: Technically speaking, any extra semantics attached to a variable such as C<$!>, C, C<%ENV>, or C<%SIG>, or to any tied variable.
es: Desde un punto de vista técnico, cualquier semántica adicional asociada a una variable, como C<$!>, C, C<%ENV> o C<%SIG>, o a cualquier variable atada.

source: Temporary aliases are implicitly created in the loop variable for C<foreach> loops, in the C<$_> variable for L<map|perlfunc/map> or L<grep|perlfunc/grep> operators, in C<$a> and C<$b> during L<sort|perlfunc/sort>'s comparison function, and in each element of C<@_> for the L</actual arguments> of a subroutine call.
es: Se crean alias temporales en la variable de los bucles C<foreach>, en la variable C<$_> para los operadores L<map|perlfunc/map> y L<grep|perlfunc/grep>, en C<$a> y C<$b> al ejecutar la función de comparación L<sort|perlfunc/sort> y en cada elemento de C<@_> para los L</argumentos reales> de la llamada a una subrutina.

source: Ten years ago it was a dead camel carcass (according to this document).
es: Hace diez años era un camello muerto (según este documento).

source: Term used by language lawyers for a storage location you can assign a new L</value> to, such as a L</variable> or an element of an L</array>.
es: Término usado por defensores de la lengua para designar una ubicación de almacenamiento a la que se puede asignar un L</valor> nuevo, como una L</variable> o un elemento de un L</array>.

source: Tests for basic control structures, C<if/else>, C<while>, subroutines, etc.
es: Pruebas de estructuras de control básicas, C<if/else>, C<while>, subrutinas, etc.

source: Tests for basic issues of how Perl parses and compiles itself.
es: Pruebas de problemas básicos relacionados con la manera en que Perl se analiza y compila.

source: Tests for built-in IO functions, including command line arguments.
es: Pruebas de funciones de E/S predefinidas, incluidos los argumentos de línea de comandos.

source: Tests for core modules in the F<lib/> directory are right next to the module itself.
es: Las pruebas de los módulos del núcleo del directorio F<lib/> se encuentran junto al módulo correspondiente.

source: Tests for features of how perl actually runs, including exit codes and handling of PERL* environment variables.
es: Pruebas de las características de funcionamiento de perl, incluidos los códigos de salida y el control de las variables de entorno PERL*.

source: Tests for modules in F<ext/> and the dual-life modules are in F<t/> subdirectories for each module, like a standard CPAN distribution.
es: Las pruebas de los módulos de F<ext/> y los módulos de evolución dual están en los subdirectorios F<t/> de cada módulo, como en una distribución de CPAN estándar.

source: Tests for perl's built in functions that don't fit into any of the other directories.
es: Pruebas de funciones predefinidas de perl que no se corresponden con ninguno de los demás directorios.

source: Tests for perl's method resolution order implementations (see L<mro>).
es: Pruebas de las implementaciones de orden de resolución de métodos de perl (vea L<mro>).

source: Tests for regex related functions or behaviour.
es: Pruebas de funciones o comportamientos relacionados con expresiones regulares

source: Tests for the absolute basic functionality of Perl.
es: Pruebas de funcionalidad básica de Perl.

source: Tests for the core support of Unicode.
es: Pruebas de compatibilidad básica con Unicode.

source: Tests the state of the source tree for various common errors.
es: Pruebas que detectan diversos errores comunes en el árbol de código fuente.

source: Text after __DATA__ may be read via the filehandle C<PACKNAME::DATA>, where C<PACKNAME> is the package that was current when the __DATA__ token was encountered.
es: El texto que hay a continuación de __DATA__ se puede leer mediante el identificador de archivo C<PAQUETE::DATA>, donde C<PAQUETE> es el paquete que estaba activo cuando se encontró el símbolo __DATA__.

source: Thank you, Perl Monks.
es: Gracias, Perl Monks.

source: Thanks to Gerard Goossen from TTY.
es: Gerard Goossen de TTY.

source: Thanks to Johan Vromans from Squirrel Consultancy.
es: Deseo expresar mi agradecimiento a las siguientes personas: Johan Vromans de Squirrel Consultancy.

source: Thanks to the collective memory of the Perlfolk.
es: Estamos agradecidos a la memoria colectiva de la comunidad Perl.

source: Thanks to the people who asked about this kind of stuff in several Perl IRC channels, and have constantly reminded me that a simpler explanation was needed.
es: Todas las personas que han hecho preguntas sobre este tema en diversos canales IRC sobre Perl y que me han recordado constantemente lo necesaria que era una explicación más sencilla.
